[{"id":1595106000,"title":"Welcome to my blog","author":"Jeremy Gehlen","date":"July 19, 2020","content":"\nThis is my new blog built with React.\n\nI will post coding related posts here such as small code snippets, boilerplates for quicker coding and other coding ideas. It is just the beginning but I feel like this blog has potential to grow into a useful tool for many starting developers like I was a few years ago.\n\n_If there was a problem_\n_Yo, I'll solve it_\n_Check out the hook while my DJ revolves it_\n\n_- Vanilla Ice_"},{"id":1595106001,"title":"My first big project with Django","author":"Jeremy Gehlen","date":"July 19, 2020","content":"\nI created an E-Commerce website for a fake coffee company called Django Coffee Co (very clever name, I know)\n\nBack in October 2019, I hadn't written a single line of Django, or Python for that matter, so this was a big challenge for me to build. I've had the idea to build something like this for a long time, but I wanted to take my time and really learn the language.\n\nWe used Django at work in Duunitori, so my learning process was relatively easy, since I had excellent co-workers to mentor me along the way.\n\nI quickly realised that learning Django was easier than I thought. This was because it is, all tho an entirely different language, quite similar to ReactJS, where you build components (html template blocks in Django), route them with Router and Switch, (views.py and urls.py in Django) etc.\n\nSo this mindset was already familiar to me when I started the learning. Besides using it at work, I also started to read about it at home. I created small projects and slowly learned the workflow. After a spending countless hours reading documentation, watching tutorial videos and taking short courses, I decided that I was finally ready to tackle this challenge of building an E-Commerce store with Django.\n\nSay hello to Django Coffee Co! A coffee package selling online store.\n\nI created it with Django and Bootstrap 4.\nThe company logo is my design I made with Adobe Illustrator.\nCoffee package mockups are from Good Mockups. however I created the design on them using Canva.\nPayments are handled with Stripe and/or Paypal\nFeel free to give it a try and purchase some items. There is are existing testing-purpose accounts that you can use while testing the website. You will find these by clicking the Login button. If you like to create your own account, feel free to do so and use that account to finish your purchases.\n\nI also created testing accounts for Stripe and PayPal to use for the payment process, so kindly use those. You will find more information along the way with the payment process.\n\nThis entire project took about 2-3 months and I am quite happy about how it turned out.\n\nI would really appreciate some feedback about this article and the project itself.\n\nThanks!\n\nYours truly,\n\nJeremy"}]